import Mathlib

/-!
# Теоремы Кантора о мощностях

В задаче предлагается доказать теоремы Кантора и Кантора-Берштейна о мощностях множеств.
-/

open scoped Classical

/-- Теорема Кантора: не существует сюръекции α → P(α).

**(25 баллов)** -/
theorem cantor (α : Type) : ¬ ∃ f : α → Set α, Function.Surjective f := by
  sorry

/-- Теорема Кантора-Берштейна: если два типа инъективно вкладываются друг в друга,
то между ними существует биекция.

Подсказка: стандартный пруф со счетной цепочкой множеств может быть сложнее
формализовать, чем абстрактный.
Если застряли, можете подсмотреть частичное решение: https://shorturl.at/5QLc5

**(75 баллов)** -/
theorem cantor_bernstein (α β : Type) (f : α → β) (g : β → α)
    (hf : Function.Injective f)
    (hg : Function.Injective g) :
    ∃ f' : α → β, Function.Bijective f' := by
  sorry

-- не забудьте в конце минимизировать импорты
#min_imports
